# -*- coding: utf-8 -*-
import scrapy


class CqddylSpider(scrapy.Spider):
    name = 'cqddyl'
    allowed_domains = ['ggfw.cqhrss.gov.cn']
    start_urls = ['http://ggfw.cqhrss.gov.cn/ggfw/QueryBLH_mainSmXz.do?code=033']

    def __init__(self):
        self.area = {"5000000300":"市本级","5001010300":"万州区","5001140300":"黔江区","5001020300":"涪陵区","5001030300":"渝中区",
							"5001040300":"大渡口区","5001050300":"江北区","5001060300":"沙坪坝区","5001070300":"九龙坡区","5001080300":"南岸区",
							"5001090300":"北碚区","5001120300":"渝北区","5001130300":"巴南区","5001160300":"江津区","5001170300":"合川区",
							"5001180300":"永川区","5001150300":"长寿区","5002220300":"綦江区","5002230300":"潼南区","5002240300":"铜梁区",
							"5002250300":"大足区","5002260300":"荣昌区","5002270300":"璧山区","5002280300":"梁平县","5002290300":"城口县",
							"5001190300":"南川区","5002300300":"丰都县","5002310300":"垫江县","5002320300":"武隆县","5002330300":"忠县",
							"5002340300":"开州区","5002350300":"云阳县","5002360300":"奉节县","5002370300":"巫山县","5002380300":"巫溪县",
							"5002400300":"石柱县","5002410300":"秀山县","5002420300":"酉阳县","5002430300":"彭水县","5009030300":"两江新区",
							"5001430300":"万盛区","5009100300":"成铁重庆社保部"}

    def parse(self, response):
        print(response.body)
        areacodes = response.css('select#jbjg option').extract()[1:]
        print(areacodes)
        pass
